paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/listPaymentResources.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.listPaymentResources"> 
   <soapenv:Header/>
   <soapenv:Body>
      <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
      <urn:authorization>Bearer -ZMfIQKJwsLCRCIrocRDcx1gwigOl8Oqyx9ew.IDW2M</urn:authorization>
   </soapenv:Body>
</soapenv:Envelope>
